# -*- coding: utf-8 -*-
import csv, json, os
from IPython import embed

jingwei = [
('重庆', 106.549, 29.581),
('北京', 116.408, 39.904),
('上海', 121.445, 31.213),
('广州', 113.265, 23.108),
('武汉', 114.279, 30.573),
('济南', 117.009, 36.663),
('深圳', 114.109, 22.544),
('乌鲁木齐', 87.585, 43.781),
('兰州', 103.751, 36.068),
('南京', 118.769, 32.048),
('南宁', 108.295, 22.838),
('南昌', 115.889, 28.671),
('合肥', 117.275, 31.861),
('呼和浩特', 111.686, 40.819),
('哈尔滨', 126.645, 45.758),
('大连', 121.576, 38.944),
('天津', 117.246, 39.117),
('太原', 112.551, 37.893),
('成都', 104.071, 30.670),
# ('拉萨', 91.126, 29.656),
('昆明', 102.702, 25.051),
('杭州', 120.165, 30.319),
('沈阳', 123.418, 41.799),
('石家庄', 114.498, 38.042),
# ('福州', 119.303, 26.071),
('西宁', 101.778, 36.621),
('贵阳', 106.700, 26.572),
('郑州', 113.641, 34.758),
('银川', 106.263, 38.468),
('长春', 125.324, 43.871),
('长沙', 112.967, 28.197),
('西安', 108.969, 34.285)]
# ('秦皇岛', 119.601, 39.932),
# ('厦门', 118.070, 24.445),
# ('赣州', 114.916, 25.832),
# ('上饶', 117.956, 28.451),
# ('徐州', 117.188, 34.263),
# ('连云港', 119.167, 34.599),
# ('青岛', 120.343, 36.088),
# ('襄阳', 112.150, 32.180),
# # ('巴东', 110.312, 30.813),
# # ('乐山', 103.747, 29.564),
# ('怀化', 109.945, 27.553),
# ('汉中', 107.025, 33.071),
# ('广元', 105.819, 32.446),
# ('桂林', 110.277, 25.281),
# ('衡阳', 112.614, 26.902)
# ]

edge = [
# ['哈尔滨', '长春'],
# ['长春', '沈阳'],
# ['沈阳', '大连'],
# ['沈阳', '天津'],
# ['沈阳', '北京'],
# ['北京', '天津'],
# ['北京', '呼和浩特'],
# ['北京', '石家庄'],
# ['天津', '济南'],
# ['石家庄', '济南'],
# ['石家庄', '太原'],
# ['石家庄', '郑州'],
# ['济南', '青岛'],
# ['济南', '郑州'],
# ['济南', '徐州'],
# ['青岛', '连云港'],
# ['连云港', '徐州'],
# ['连云港', '上海'],
# ['连云港', '南京'],
# ['上海', '南京'],
# ['上海', '杭州'],
# ['南京', '合肥'],
# ['南京', '杭州'],
# ['杭州', '上饶'],
# ['杭州', '福州'],
# ['杭州', '合肥'],
# ['上饶', '合肥'],
# ['上饶', '福州'],
# ['上饶', '南昌'],
# ['合肥', '郑州'],
# ['合肥', '武汉'],
# ['合肥', '徐州'],
# ['徐州', '郑州'],
# ['福州', '南昌'],
# ['福州', '厦门'],
# ['厦门', '赣州'],
# ['厦门', '深圳'],
# ['赣州', '南昌'],
# ['赣州', '长沙'],
# ['赣州', '深圳'],
# ['南昌', '武汉'],
# ['南昌', '长沙'],
# ['深圳', '广州'],
# ['武汉', '襄阳'],
# ['武汉', '郑州'],
# ['武汉', '长沙'],
# # ['武汉', '巴东'],
# ['郑州', '襄阳'],
# ['郑州', '太原'],
# ['郑州', '西安'],
# ['太原', '呼和浩特'],
# ['太原', '西安'],
# ['西安', '银川'],
# ['西安', '兰州'],
# ['西安', '汉中'],
# ['西安', '襄阳'],
# # ['襄阳', '巴东'],
# # ['巴东', '重庆'],
# # ['巴东', '成都'],
# ['银川', '兰州'],
# ['兰州', '西宁'],
# ['西宁', '乌鲁木齐'],
# ['兰州', '成都'],
# ['汉中', '重庆'],
# ['汉中', '广元'],
# ['兰州', '广元'],
# ['广元', '成都'],
# ['广元', '重庆'],
# ['成都', '重庆'],
# # ['成都', '乐山'],
# # ['乐山', '昆明'],
# # ['乐山', '贵阳'],
# ['贵阳', '昆明'],
# ['昆明', '南宁'],
# ['贵阳', '重庆'],
# ['贵阳', '怀化'],
# ['贵阳', '桂林'],
# ['南宁', '桂林'],
# ['桂林', '广州'],
# ['南宁', '广州'],
# ['怀化', '长沙'],
# ['怀化', '重庆'],
# ['怀化', '衡阳'],
# ['长沙', '衡阳'],
# ['桂林', '衡阳'],
# ['衡阳', '广州'],
# ['衡阳', '赣州'],
# ['拉萨', '成都']
]

with open('keystations.txt', 'w', encoding='utf-8') as f:
    f.write(str([station for station, lng, let in jingwei]))

D = {'nodes':{}, 'links':[]}
for station, lng, lat in jingwei:
    D['nodes'][station] = [lng, lat]

citypair2railways = {}
with open('network.json', 'r') as f:
    D1 = json.load(f)
    for railway_name, D2 in D1.items():
        for i in range(len(D2['route'])-1):
            uu = D2['route'][i]
            vv = D2['route'][i+1]
            if (uu, vv) not in citypair2railways:
                tmp = vv
                vv = uu
                uu = tmp
            citypair2railways.setdefault((uu, vv), []).append({
                'name': railway_name,
                'date': D2['date'],
                'service': D2['service'],
                'electrification': D2['electrification']
            })
for k,v in citypair2railways.items():
    D['links'].append({
        'u': k[0],
        'v': k[1],
        'railways': v
    })

with open('../json/tmp.json', 'w') as f:
    # js = json.dumps(D, ensure_ascii=False)
    # shown in chinese character instead of \uxxx
    json.dump(D, f)
